## Production: s3
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                      |
|--------|-------------------------------------------------------------------------------|
| add    | `aws_s3_bucket.lambda_code`                                                   |
|        | `aws_s3_bucket_lifecycle_configuration.archive_storage`                       |
|        | `aws_s3_bucket_lifecycle_configuration.reliability_file_storage`              |
|        | `aws_s3_bucket_ownership_controls.archive_storage`                            |
|        | `aws_s3_bucket_ownership_controls.lambda_code`                                |
|        | `aws_s3_bucket_ownership_controls.reliability_file_storage`                   |
|        | `aws_s3_bucket_ownership_controls.vault_file_storage`                         |
|        | `aws_s3_bucket_public_access_block.archive_storage`                           |
|        | `aws_s3_bucket_public_access_block.lambda_code`                               |
|        | `aws_s3_bucket_public_access_block.reliability_file_storage`                  |
|        | `aws_s3_bucket_public_access_block.vault_file_storage`                        |
|        | `aws_s3_bucket_server_side_encryption_configuration.archive_storage`          |
|        | `aws_s3_bucket_server_side_encryption_configuration.lambda_code`              |
|        | `aws_s3_bucket_server_side_encryption_configuration.reliability_file_storage` |
|        | `aws_s3_bucket_server_side_encryption_configuration.vault_file_storage`       |
|        | `aws_s3_bucket_versioning.lambda_code`                                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.archive_storage will be imported
    resource "aws_s3_bucket" "archive_storage" {
        arn                         = "arn:aws:s3:::forms-production-archive-storage"
        bucket                      = "forms-production-archive-storage"
        bucket_domain_name          = "forms-production-archive-storage.s3.amazonaws.com"
        bucket_regional_domain_name = "forms-production-archive-storage.s3.ca-central-1.amazonaws.com"
        hosted_zone_id              = "Z1QDHH18159H29"
        id                          = "forms-production-archive-storage"
        object_lock_enabled         = false
        region                      = "ca-central-1"
        request_payer               = "BucketOwner"
        tags                        = {}
        tags_all                    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }

        grant {
            id          = "9a5058ac2253284c428c54c019d006666ef3eb73e380322b05c715157b6c384a"
            permissions = [
                "FULL_CONTROL",
            ]
            type        = "CanonicalUser"
        }

        lifecycle_rule {
            abort_incomplete_multipart_upload_days = 0
            enabled                                = true
            id                                     = "tf-s3-lifecycle-20211203130131293400000001"
            tags                                   = {}

            expiration {
                days                         = 30
                expired_object_delete_marker = false
            }
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = false

                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # aws_s3_bucket.lambda_code will be created
  + resource "aws_s3_bucket" "lambda_code" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "forms-production-lambda-code"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.reliability_file_storage will be imported
    resource "aws_s3_bucket" "reliability_file_storage" {
        arn                         = "arn:aws:s3:::forms-production-reliability-file-storage"
        bucket                      = "forms-production-reliability-file-storage"
        bucket_domain_name          = "forms-production-reliability-file-storage.s3.amazonaws.com"
        bucket_regional_domain_name = "forms-production-reliability-file-storage.s3.ca-central-1.amazonaws.com"
        hosted_zone_id              = "Z1QDHH18159H29"
        id                          = "forms-production-reliability-file-storage"
        object_lock_enabled         = false
        region                      = "ca-central-1"
        request_payer               = "BucketOwner"
        tags                        = {}
        tags_all                    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }

        grant {
            id          = "9a5058ac2253284c428c54c019d006666ef3eb73e380322b05c715157b6c384a"
            permissions = [
                "FULL_CONTROL",
            ]
            type        = "CanonicalUser"
        }

        lifecycle_rule {
            abort_incomplete_multipart_upload_days = 0
            enabled                                = true
            id                                     = "tf-s3-lifecycle-20211203130332608200000002"
            tags                                   = {}

            expiration {
                days                         = 30
                expired_object_delete_marker = false
            }
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = false

                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # aws_s3_bucket.vault_file_storage will be imported
    resource "aws_s3_bucket" "vault_file_storage" {
        arn                         = "arn:aws:s3:::forms-production-vault-file-storage"
        bucket                      = "forms-production-vault-file-storage"
        bucket_domain_name          = "forms-production-vault-file-storage.s3.amazonaws.com"
        bucket_regional_domain_name = "forms-production-vault-file-storage.s3.ca-central-1.amazonaws.com"
        hosted_zone_id              = "Z1QDHH18159H29"
        id                          = "forms-production-vault-file-storage"
        object_lock_enabled         = false
        policy                      = jsonencode(
            {
                Statement = [
                    {
                        Action    = [
                            "s3:PutObjectVersionTagging",
                            "s3:PutObjectTagging",
                            "s3:DeleteObjectVersionTagging",
                            "s3:DeleteObjectTagging",
                        ]
                        Condition = {
                            StringNotLike = {
                                "aws:PrincipalArn" = "arn:aws:iam::957818836222:role/ScanFilesGetObjects"
                            }
                        }
                        Effect    = "Deny"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "arn:aws:s3:::forms-production-vault-file-storage/*"
                        Sid       = ""
                    },
                    {
                        Action    = [
                            "s3:PutObjectVersionTagging",
                            "s3:PutObjectTagging",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::957818836222:role/ScanFilesGetObjects"
                        }
                        Resource  = "arn:aws:s3:::forms-production-vault-file-storage/*"
                        Sid       = ""
                    },
                    {
                        Action    = [
                            "s3:ListBucket",
                            "s3:GetObjectVersionTagging",
                            "s3:GetObjectVersion",
                            "s3:GetObjectTagging",
                            "s3:GetObject",
                            "s3:GetBucketLocation",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::957818836222:role/ScanFilesGetObjects"
                        }
                        Resource  = [
                            "arn:aws:s3:::forms-production-vault-file-storage/*",
                            "arn:aws:s3:::forms-production-vault-file-storage",
                        ]
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        region                      = "ca-central-1"
        request_payer               = "BucketOwner"
        tags                        = {}
        tags_all                    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }

        grant {
            id          = "9a5058ac2253284c428c54c019d006666ef3eb73e380322b05c715157b6c384a"
            permissions = [
                "FULL_CONTROL",
            ]
            type        = "CanonicalUser"
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = false

                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = true
            mfa_delete = false
        }
    }

  # aws_s3_bucket_lifecycle_configuration.archive_storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "archive_storage" {
      + bucket = "forms-production-archive-storage"
      + id     = (known after apply)

      + rule {
          + id     = "Clear Archive Storage after 30 days"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.reliability_file_storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "reliability_file_storage" {
      + bucket = "forms-production-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + id     = "Clear Reliability Queue after 30 days"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_ownership_controls.archive_storage will be created
  + resource "aws_s3_bucket_ownership_controls" "archive_storage" {
      + bucket = "forms-production-archive-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_ownership_controls.lambda_code will be created
  + resource "aws_s3_bucket_ownership_controls" "lambda_code" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_ownership_controls.reliability_file_storage will be created
  + resource "aws_s3_bucket_ownership_controls" "reliability_file_storage" {
      + bucket = "forms-production-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_ownership_controls.vault_file_storage will be created
  + resource "aws_s3_bucket_ownership_controls" "vault_file_storage" {
      + bucket = "forms-production-vault-file-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_public_access_block.archive_storage will be created
  + resource "aws_s3_bucket_public_access_block" "archive_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "forms-production-archive-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.lambda_code will be created
  + resource "aws_s3_bucket_public_access_block" "lambda_code" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.reliability_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "reliability_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "forms-production-reliability-file-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.vault_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "vault_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "forms-production-vault-file-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.archive_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "archive_storage" {
      + bucket = "forms-production-archive-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.lambda_code will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "lambda_code" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.reliability_file_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "reliability_file_storage" {
      + bucket = "forms-production-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.vault_file_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "vault_file_storage" {
      + bucket = "forms-production-vault-file-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.lambda_code will be created
  + resource "aws_s3_bucket_versioning" "lambda_code" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 3 to import, 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + archive_storage_arn          = "arn:aws:s3:::forms-production-archive-storage"
  + archive_storage_id           = "forms-production-archive-storage"
  + lambda_code_arn              = (known after apply)
  + lambda_code_id               = (known after apply)
  + reliability_file_storage_arn = "arn:aws:s3:::forms-production-reliability-file-storage"
  + reliability_file_storage_id  = "forms-production-reliability-file-storage"
  + vault_file_storage_arn       = "arn:aws:s3:::forms-production-vault-file-storage"
  + vault_file_storage_id        = "forms-production-vault-file-storage"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.archive_storage"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.lambda_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.reliability_file_storage"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.vault_file_storage"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
